In [2]:
import pandas as pd

## Series

In [3]:
data = [1, 2, 3, 4, 5]

In [4]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ["Linha" + str(i) for i in range(1,6)]

In [6]:
index

['Linha1', 'Linha2', 'Linha3', 'Linha4', 'Linha5']

In [7]:
s.index = index
# s = pd.Series(data = data, index = index)

In [8]:
s

Linha1    1
Linha2    2
Linha3    3
Linha4    4
Linha5    5
dtype: int64

In [9]:
data = {"linha" + str(i) : i for i in range(5)}

In [10]:
data

{'linha0': 0, 'linha1': 1, 'linha2': 2, 'linha3': 3, 'linha4': 4}

In [11]:
s = pd.Series(data)

In [12]:
s

linha0    0
linha1    1
linha2    2
linha3    3
linha4    4
dtype: int64

In [13]:
s1 = s + 2

In [14]:
s1

linha0    2
linha1    3
linha2    4
linha3    5
linha4    6
dtype: int64

## DataFrame

In [15]:
data = [[1, 2, 3],[4, 5, 6],[7, 8, 9]]

In [16]:
df1 = pd.DataFrame(data)

In [17]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
index = ["Linha" + str(i) for i in range(3)]

In [19]:
index

['Linha0', 'Linha1', 'Linha2']

In [20]:
df1 = pd.DataFrame(data, index)

In [21]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [22]:
columns = ["Coluna" + str(i) for i in range(3)]

In [23]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [24]:
df1.columns = columns

In [25]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [26]:
data = {"Coluna0": {"Linha0": 1, "Linha1": 4, "Linha2": 7},
        "Coluna1": {"Linha0": 2, "Linha1": 5, "Linha2": 8},
        "Coluna2": {"Linha0": 3, "Linha1": 6, "Linha2": 9}}

In [27]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [28]:
df2 = pd.DataFrame(data)

In [29]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [30]:
data = [(1, 2, 3),(4, 5, 6),(7, 8, 9)]

In [31]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [32]:
df3 = pd.DataFrame(data, index, columns)

In [33]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [34]:
df1[df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [35]:
df2[df2 > 0] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [36]:
df3[df3 > 0] = "C"
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [37]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [38]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C